class ParentQueue<T>:
    // конструктор
    // постусловие: создана пустая очередь
    def __init__(self):
        pass

    // команды
    // постусловие: добавлен новый элемент в хвост очереди
    def add_tail(self, value);

    // предусловие: очередь не пуста
    // постусловие: удалён элемент из головы очереди
    def remove_front(self);

    // запросы
    // предусловие: очередь не пуста
    // возвращен первый элемент очереди
    def get_front(self);

    // текущий размер очереди
    def size(self);

    //запросы статусов

    def get_remove_front_status(self)  -> bool; // успешно; элемент удален из головы

    def get_get_front_status(self)  -> bool; // успешно; возвращен первый элемент



// --------------------------------------------------
// Queue
// --------------------------------------------------

class Queue(ParentQueue[T]):
    // Дополнительной логики не требуется.
    // Интерфейс Queue не предоставляет add_front(), remove_tail() пользователю.
    // Вся реализация операций находится в ParentQueue.



// --------------------------------------------------
// Deque
// --------------------------------------------------

class Deque(ParentQueue[T]):

    // Команды
    // постусловие: добавлен новый элемент в голову очереди
    def add_front(self, value);

    // предусловие: очередь не пуста
    // постусловие: удалён элемент из хвоста очереди
    def remove_tail(self);

    // запросы
    // предусловие: очередь не пуста
    // возвращает последний элемент очереди
    def get_tail(self);

    // запросы статусов

    def get_remove_tail_status(self)  -> bool; // успешно; элемент удален из хвоста
    def get_get_tail_status(self) -> bool;