class Queue<T>:
    // конструктор
    // постусловие: создана пустая очередь
    def __init__(self):
        pass

    // команды
    // постусловие: добавлен новый элемент в хвост очереди
    def enqueue(self, value);

    // предусловие: очередь не пуста
    // постусловие: удалён элемент из головы очереди
    def dequeue(self);

    // запросы
    // предусловие: очередь не пуста
    def get(self);

    // текущий размер очереди
    def size(self);

    //запросы статусов

    def get_dequeue_status(self); // успешно; очередь пуста

    def get_get_status(self); // успешно; очередь пуста