abstract class DynArray<T>:

    // статусы
    MAKE_ARRAY_NIL = 0 // make_array() еще не вызывался
    MAKE_ARRAY_OK = 1 // создан новый блок памяти емкостью new_capacity
    MAKE_ARRAY_ERR = 2 // емкость не задана, массив не создан

    RESIZE_NIL = 0 // resize() пока не вызывался
    RESIZE_OK = 1 //  изменена емкость существующего массива
    RESIZE_ERR = 2 // заданная емкость меньше существующего массива

    APPEND_NIL = 0 // метод append() еще не вызывался
    APPEND_OK = 1 // новый элемент успешно добавлен в список
    APPEND_ERR = 2 // элемент не добавлен

    INSERT_NIL = 0 // метод insert() еще не вызывался
    INSERT_OK = 1 // новый элемент успешно добавлен в по указанному индексу
    INSERT_ERR = 2 // элемент не добавлен по указанному индексу

    DELETE_NIL = 0 // метод delete() еще не вызывался
    DELETE_OK = 1 // элемент успешно удален
    DELETE_ERR = 2 // элемент не удален

    // конструктор
    // постусловие: создан пустой массив заданной емкости, "банковский счет" пуст
    DynArray<T>()


        //команды
    // постусловие: создан пустой массив заданной емкости, возвращена ссылка на данный массив
    def make_array(value);

    // предусловие: новая емкость не меньше количества существующих элементов
    // постусловие: размерность массива изменена, текущие элементы перенесены в новый массив
    def resize(value);

    // постусловие: в текущий массив добавлен элемент, емкость массива увеличен при необходимости
    def append(value);

    // предусловие: индекс добавляемого элемента допустим
    // постусловие: элемент по указанному индексу добавлен, при необхоидмости увеличена емкость массива
    def insert(index, value);

    // предусловие: массив непустой
    // постусловие: целевой элемент удален, элементы сдвинуты влево
    // при необходимости уменьшена емкость массива
    def delete(index);

        //запросы:
    // предусловие: массив непустой, индекс находится в зоне допустимых
    def getitem(index) // возвращает значение элемента по заданному индексу
    def len() // возвращает длину массива

    // дополнительные запросы
    get_make_array_status(); возвращает значение GET_MAKE_ARRAY *
    get_make_resize_status(); возвращает значение GET_MAKE_RESIZE *
    get_append_status(); возвращает значение GET_APPEND *
    get_insert_status(); возвращает значение GET_INSERT *
    get_delete_status(); возвращает значение GET_DELETE *



